#第九节 是对还是错 -- 布尔类型

#知识点1 比较运算符
"""

"""








#游戏环节-小小判官，判断下列式子是否正确
"""
6 > 5   6 < 8   6 == 6   7 >= 6   6 <= 6  6 != 5  #True

6 < 5   6 > 8   6 == 5   7 <= 6   6 <= 5  6 != 6  #False

True和False是bool值

"""


#知识点2 逻辑运算符
"""


"""

#课堂练习1
"""
1. 小明同学带了一些钱去帮同学们买本子。请根据所带的元数、单价和数量，算
一算钱够不够。
要求：
    (1) 程序运行后，输入三次数字，分别代表钱数、本子的单价和数量；
    (2) 输出一行，钱足够买就输出"True"，钱不够买就输出"False"（不要输出引号）。

"""


"""
2. 请用户输入一个两个数，分别代表语文和数学成绩，输出判断该同学是否达到优秀学员（语文 >= 90 数学 >= 90）,如果是则输出"True"，否则输出"False
语文 >= 90 数学 >= 90
chinese >= 90  and  math >= 90
"""

