#第七节 来做四则运算吧 -- 算术运算符
#课堂练习1
"""
请用户输入内容，将其分别请用户输入两个整数，计算输出这两个数的和、差、积、商
输入样例：
  5
  8
输出样例：
  5 + 8 = 13
  5 - 8 = -3
  5 * 8 = 40
  5 / 8 = 0.625
"""
a = input("first:")
b = input("second:")

print(a,"+",b,"=",int(a)+int(b))
print(a,"-",b,"=",int(a)-int(b))
print(a,"*",b,"=",int(a)*int(b))
print(a,"/",b,"=",int(a)/int(b))

"""
加法运算符：+
减法运算符：-
乘法运算符：*
除法运算符: /
得到的结果一定是浮点数类型
除数不能为0
"""
#课堂练习2
#请用户输入自己的语文、数学、英语成绩，输出总成绩和平均成绩
ch = int(input("chinese:"))
ma = int(input("math:"))
en = int(input("english"))

print(ch + ma + en )
print((ch + ma +en ) / 3)

#课堂练习3
#请用户输入两个整数，计算输出这两个数的商、余数
#例如 13 / 3 = 4 --------1
a = input()
b = input()
print(int(a) // int(b)) #取整
print(int(a) % int(b))  #取余

"""
整除运算符：//
  得到的商是整数
取余运算符：%
  得到的结果是两个数相除的余数
幂运算符：**
  表达式 x ** y 表示 x 的 y 次方，也可以理解成 y 个 x 相
乘

"""
#课堂练习4
#请输入输入一个三位数，输出这个三位数的个位、十位、百位
#例如： 123 -》1个百+2个十+3个一
# 个位    123 / 10  = 12  ---- 3   取余
# 十位    123 / 10  = 12     12 / 10 =  1----2    先取整再取余
# 百位     123 / 100  = 1  ----- 23 取整
num = int(input("num"))
a = num % 10
b = num // 10 % 10
c = num // 100
print("个位",a)
print("十位",b)
print("百位",c)
